Revit 2026 API

# ParameterElementGetDefinition Method

---

Get the definition representing this parameter element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public InternalDefinition GetDefinition()
```
```vb
Public Function GetDefinition As InternalDefinition
```
```cpp
public:
InternalDefinition^ GetDefinition()
```
```fsharp
member GetDefinition : unit -> InternalDefinition
```

#### Return Value

InternalDefinition The parameter.

#### Reference

ParameterElement Class

Autodesk.Revit.DB Namespace